IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/MCU_PADCFG_CTRL0_CFG0.xml
	<register id="CFG0_PADCONFIG3" acronym="CFG0_PADCONFIG3" offset="0x400C" width="32" description="">
		<bitfield id="PADCONFIG3_LOCK" width="1" begin="31" end="31" resetval="0x0" description="Lock" range="31" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG3_TX_DIS" width="1" begin="21" end="21" resetval="0x1" description="Driver Disable" range="21" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG3_DRV_STR" width="2" begin="20" end="19" resetval="0x0" description="Drive Strength Control .  Selects the drive strength value for LVCMOS pins.  (Does not apply to other pin types)" range="20 - 19" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG3_RXACTIVE" width="1" begin="18" end="18" resetval="0x0" description="Input enable for the Pad" range="18" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG3_PULLTYPESEL" width="1" begin="17" end="17" resetval="0x0" description="Pad Pullup / Pulldown type selection" range="17" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG3_PULLUDEN" width="1" begin="16" end="16" resetval="0x1" description="Pad Pullup / Pulldown enable. This is an active low signal." range="16" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG3_ST_EN" width="1" begin="14" end="14" resetval="0x1" description="Receiver Schmitt Trigger enable" range="14" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG3_DEBOUNCE_SEL" width="3" begin="13" end="11" resetval="0x0" description="Selects the debouce period for the pad." range="13 - 11" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG3_MUXMODE" width="4" begin="3" end="0" resetval="0x7" description="Pad functional signal mux selection" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_PADCONFIG4" acronym="CFG0_PADCONFIG4" offset="0x4010" width="32" description="">
		<bitfield id="PADCONFIG4_LOCK" width="1" begin="31" end="31" resetval="0x0" description="Lock" range="31" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG4_TX_DIS" width="1" begin="21" end="21" resetval="0x1" description="Driver Disable" range="21" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG4_DRV_STR" width="2" begin="20" end="19" resetval="0x0" description="Drive Strength Control .  Selects the drive strength value for LVCMOS pins.  (Does not apply to other pin types)" range="20 - 19" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG4_RXACTIVE" width="1" begin="18" end="18" resetval="0x0" description="Input enable for the Pad" range="18" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG4_PULLTYPESEL" width="1" begin="17" end="17" resetval="0x0" description="Pad Pullup / Pulldown type selection" range="17" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG4_PULLUDEN" width="1" begin="16" end="16" resetval="0x1" description="Pad Pullup / Pulldown enable. This is an active low signal." range="16" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG4_ST_EN" width="1" begin="14" end="14" resetval="0x1" description="Receiver Schmitt Trigger enable" range="14" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG4_DEBOUNCE_SEL" width="3" begin="13" end="11" resetval="0x0" description="Selects the debouce period for the pad." range="13 - 11" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG4_MUXMODE" width="4" begin="3" end="0" resetval="0x7" description="Pad functional signal mux selection" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_PADCONFIG5" acronym="CFG0_PADCONFIG5" offset="0x4014" width="32" description="">
		<bitfield id="PADCONFIG5_LOCK" width="1" begin="31" end="31" resetval="0x0" description="Lock" range="31" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG5_TX_DIS" width="1" begin="21" end="21" resetval="0x1" description="Driver Disable" range="21" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG5_DRV_STR" width="2" begin="20" end="19" resetval="0x0" description="Drive Strength Control .  Selects the drive strength value for LVCMOS pins.  (Does not apply to other pin types)" range="20 - 19" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG5_RXACTIVE" width="1" begin="18" end="18" resetval="0x0" description="Input enable for the Pad" range="18" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG5_PULLTYPESEL" width="1" begin="17" end="17" resetval="0x0" description="Pad Pullup / Pulldown type selection" range="17" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG5_PULLUDEN" width="1" begin="16" end="16" resetval="0x1" description="Pad Pullup / Pulldown enable. This is an active low signal." range="16" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG5_ST_EN" width="1" begin="14" end="14" resetval="0x1" description="Receiver Schmitt Trigger enable" range="14" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG5_DEBOUNCE_SEL" width="3" begin="13" end="11" resetval="0x0" description="Selects the debouce period for the pad." range="13 - 11" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG5_MUXMODE" width="4" begin="3" end="0" resetval="0x7" description="Pad functional signal mux selection" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_PADCONFIG6" acronym="CFG0_PADCONFIG6" offset="0x4018" width="32" description="">
		<bitfield id="PADCONFIG6_LOCK" width="1" begin="31" end="31" resetval="0x0" description="Lock" range="31" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG6_TX_DIS" width="1" begin="21" end="21" resetval="0x1" description="Driver Disable" range="21" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG6_DRV_STR" width="2" begin="20" end="19" resetval="0x0" description="Drive Strength Control .  Selects the drive strength value for LVCMOS pins.  (Does not apply to other pin types)" range="20 - 19" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG6_RXACTIVE" width="1" begin="18" end="18" resetval="0x0" description="Input enable for the Pad" range="18" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG6_PULLTYPESEL" width="1" begin="17" end="17" resetval="0x0" description="Pad Pullup / Pulldown type selection" range="17" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG6_PULLUDEN" width="1" begin="16" end="16" resetval="0x1" description="Pad Pullup / Pulldown enable. This is an active low signal." range="16" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG6_ST_EN" width="1" begin="14" end="14" resetval="0x1" description="Receiver Schmitt Trigger enable" range="14" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG6_DEBOUNCE_SEL" width="3" begin="13" end="11" resetval="0x0" description="Selects the debouce period for the pad." range="13 - 11" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG6_MUXMODE" width="4" begin="3" end="0" resetval="0x7" description="Pad functional signal mux selection" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_PADCONFIG7" acronym="CFG0_PADCONFIG7" offset="0x401C" width="32" description="">
		<bitfield id="PADCONFIG7_LOCK" width="1" begin="31" end="31" resetval="0x0" description="Lock" range="31" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG7_TX_DIS" width="1" begin="21" end="21" resetval="0x1" description="Driver Disable" range="21" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG7_DRV_STR" width="2" begin="20" end="19" resetval="0x0" description="Drive Strength Control .  Selects the drive strength value for LVCMOS pins.  (Does not apply to other pin types)" range="20 - 19" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG7_RXACTIVE" width="1" begin="18" end="18" resetval="0x0" description="Input enable for the Pad" range="18" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG7_PULLTYPESEL" width="1" begin="17" end="17" resetval="0x0" description="Pad Pullup / Pulldown type selection" range="17" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG7_PULLUDEN" width="1" begin="16" end="16" resetval="0x1" description="Pad Pullup / Pulldown enable. This is an active low signal." range="16" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG7_ST_EN" width="1" begin="14" end="14" resetval="0x1" description="Receiver Schmitt Trigger enable" range="14" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG7_DEBOUNCE_SEL" width="3" begin="13" end="11" resetval="0x0" description="Selects the debouce period for the pad." range="13 - 11" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG7_MUXMODE" width="4" begin="3" end="0" resetval="0x7" description="Pad functional signal mux selection" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_PADCONFIG8" acronym="CFG0_PADCONFIG8" offset="0x4020" width="32" description="">
		<bitfield id="PADCONFIG8_LOCK" width="1" begin="31" end="31" resetval="0x0" description="Lock" range="31" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG8_TX_DIS" width="1" begin="21" end="21" resetval="0x1" description="Driver Disable" range="21" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG8_DRV_STR" width="2" begin="20" end="19" resetval="0x0" description="Drive Strength Control .  Selects the drive strength value for LVCMOS pins.  (Does not apply to other pin types)" range="20 - 19" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG8_RXACTIVE" width="1" begin="18" end="18" resetval="0x0" description="Input enable for the Pad" range="18" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG8_PULLTYPESEL" width="1" begin="17" end="17" resetval="0x0" description="Pad Pullup / Pulldown type selection" range="17" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG8_PULLUDEN" width="1" begin="16" end="16" resetval="0x1" description="Pad Pullup / Pulldown enable. This is an active low signal." range="16" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG8_ST_EN" width="1" begin="14" end="14" resetval="0x1" description="Receiver Schmitt Trigger enable" range="14" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG8_DEBOUNCE_SEL" width="3" begin="13" end="11" resetval="0x0" description="Selects the debouce period for the pad." range="13 - 11" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG8_MUXMODE" width="4" begin="3" end="0" resetval="0x7" description="Pad functional signal mux selection" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_PADCONFIG9" acronym="CFG0_PADCONFIG9" offset="0x4024" width="32" description="">
		<bitfield id="PADCONFIG9_LOCK" width="1" begin="31" end="31" resetval="0x0" description="Lock" range="31" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG9_TX_DIS" width="1" begin="21" end="21" resetval="0x1" description="Driver Disable" range="21" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG9_DRV_STR" width="2" begin="20" end="19" resetval="0x0" description="Drive Strength Control .  Selects the drive strength value for LVCMOS pins.  (Does not apply to other pin types)" range="20 - 19" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG9_RXACTIVE" width="1" begin="18" end="18" resetval="0x0" description="Input enable for the Pad" range="18" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG9_PULLTYPESEL" width="1" begin="17" end="17" resetval="0x0" description="Pad Pullup / Pulldown type selection" range="17" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG9_PULLUDEN" width="1" begin="16" end="16" resetval="0x1" description="Pad Pullup / Pulldown enable. This is an active low signal." range="16" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG9_ST_EN" width="1" begin="14" end="14" resetval="0x1" description="Receiver Schmitt Trigger enable" range="14" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG9_DEBOUNCE_SEL" width="3" begin="13" end="11" resetval="0x0" description="Selects the debouce period for the pad." range="13 - 11" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG9_MUXMODE" width="4" begin="3" end="0" resetval="0x7" description="Pad functional signal mux selection" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_PADCONFIG10" acronym="CFG0_PADCONFIG10" offset="0x4028" width="32" description="">
		<bitfield id="PADCONFIG10_LOCK" width="1" begin="31" end="31" resetval="0x0" description="Lock" range="31" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG10_TX_DIS" width="1" begin="21" end="21" resetval="0x1" description="Driver Disable" range="21" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG10_DRV_STR" width="2" begin="20" end="19" resetval="0x0" description="Drive Strength Control .  Selects the drive strength value for LVCMOS pins.  (Does not apply to other pin types)" range="20 - 19" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG10_RXACTIVE" width="1" begin="18" end="18" resetval="0x0" description="Input enable for the Pad" range="18" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG10_PULLTYPESEL" width="1" begin="17" end="17" resetval="0x0" description="Pad Pullup / Pulldown type selection" range="17" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG10_PULLUDEN" width="1" begin="16" end="16" resetval="0x1" description="Pad Pullup / Pulldown enable. This is an active low signal." range="16" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG10_ST_EN" width="1" begin="14" end="14" resetval="0x1" description="Receiver Schmitt Trigger enable" range="14" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG10_DEBOUNCE_SEL" width="3" begin="13" end="11" resetval="0x0" description="Selects the debouce period for the pad." range="13 - 11" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG10_MUXMODE" width="4" begin="3" end="0" resetval="0x7" description="Pad functional signal mux selection" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_PADCONFIG11" acronym="CFG0_PADCONFIG11" offset="0x402C" width="32" description="">
		<bitfield id="PADCONFIG11_LOCK" width="1" begin="31" end="31" resetval="0x0" description="Lock" range="31" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG11_TX_DIS" width="1" begin="21" end="21" resetval="0x1" description="Driver Disable" range="21" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG11_DRV_STR" width="2" begin="20" end="19" resetval="0x0" description="Drive Strength Control .  Selects the drive strength value for LVCMOS pins.  (Does not apply to other pin types)" range="20 - 19" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG11_RXACTIVE" width="1" begin="18" end="18" resetval="0x0" description="Input enable for the Pad" range="18" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG11_PULLTYPESEL" width="1" begin="17" end="17" resetval="0x0" description="Pad Pullup / Pulldown type selection" range="17" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG11_PULLUDEN" width="1" begin="16" end="16" resetval="0x1" description="Pad Pullup / Pulldown enable. This is an active low signal." range="16" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG11_ST_EN" width="1" begin="14" end="14" resetval="0x1" description="Receiver Schmitt Trigger enable" range="14" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG11_DEBOUNCE_SEL" width="3" begin="13" end="11" resetval="0x0" description="Selects the debouce period for the pad." range="13 - 11" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG11_MUXMODE" width="4" begin="3" end="0" resetval="0x7" description="Pad functional signal mux selection" range="3 - 0" rwaccess="R/W"/>
	</register>
