IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/MCU_PADCFG_CTRL0_CFG0.xml
	<register id="CFG0_PADCONFIG12" acronym="CFG0_PADCONFIG12" offset="0x4030" width="32" description="">
		<bitfield id="PADCONFIG12_LOCK" width="1" begin="31" end="31" resetval="0x0" description="Lock" range="31" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG12_TX_DIS" width="1" begin="21" end="21" resetval="0x1" description="Driver Disable" range="21" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG12_DRV_STR" width="2" begin="20" end="19" resetval="0x0" description="Drive Strength Control .  Selects the drive strength value for LVCMOS pins.  (Does not apply to other pin types)" range="20 - 19" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG12_RXACTIVE" width="1" begin="18" end="18" resetval="0x0" description="Input enable for the Pad" range="18" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG12_PULLTYPESEL" width="1" begin="17" end="17" resetval="0x0" description="Pad Pullup / Pulldown type selection" range="17" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG12_PULLUDEN" width="1" begin="16" end="16" resetval="0x1" description="Pad Pullup / Pulldown enable. This is an active low signal." range="16" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG12_ST_EN" width="1" begin="14" end="14" resetval="0x1" description="Receiver Schmitt Trigger enable" range="14" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG12_DEBOUNCE_SEL" width="3" begin="13" end="11" resetval="0x0" description="Selects the debouce period for the pad." range="13 - 11" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG12_MUXMODE" width="4" begin="3" end="0" resetval="0x7" description="Pad functional signal mux selection" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_PADCONFIG13" acronym="CFG0_PADCONFIG13" offset="0x4034" width="32" description="">
		<bitfield id="PADCONFIG13_LOCK" width="1" begin="31" end="31" resetval="0x0" description="Lock" range="31" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG13_TX_DIS" width="1" begin="21" end="21" resetval="0x1" description="Driver Disable" range="21" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG13_DRV_STR" width="2" begin="20" end="19" resetval="0x0" description="Drive Strength Control .  Selects the drive strength value for LVCMOS pins.  (Does not apply to other pin types)" range="20 - 19" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG13_RXACTIVE" width="1" begin="18" end="18" resetval="0x0" description="Input enable for the Pad" range="18" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG13_PULLTYPESEL" width="1" begin="17" end="17" resetval="0x0" description="Pad Pullup / Pulldown type selection" range="17" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG13_PULLUDEN" width="1" begin="16" end="16" resetval="0x1" description="Pad Pullup / Pulldown enable. This is an active low signal." range="16" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG13_ST_EN" width="1" begin="14" end="14" resetval="0x1" description="Receiver Schmitt Trigger enable" range="14" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG13_DEBOUNCE_SEL" width="3" begin="13" end="11" resetval="0x0" description="Selects the debouce period for the pad." range="13 - 11" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG13_MUXMODE" width="4" begin="3" end="0" resetval="0x7" description="Pad functional signal mux selection" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_PADCONFIG14" acronym="CFG0_PADCONFIG14" offset="0x4038" width="32" description="">
		<bitfield id="PADCONFIG14_LOCK" width="1" begin="31" end="31" resetval="0x0" description="Lock" range="31" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG14_TX_DIS" width="1" begin="21" end="21" resetval="0x1" description="Driver Disable" range="21" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG14_DRV_STR" width="2" begin="20" end="19" resetval="0x0" description="Drive Strength Control .  Selects the drive strength value for LVCMOS pins.  (Does not apply to other pin types)" range="20 - 19" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG14_RXACTIVE" width="1" begin="18" end="18" resetval="0x0" description="Input enable for the Pad" range="18" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG14_PULLTYPESEL" width="1" begin="17" end="17" resetval="0x0" description="Pad Pullup / Pulldown type selection" range="17" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG14_PULLUDEN" width="1" begin="16" end="16" resetval="0x1" description="Pad Pullup / Pulldown enable. This is an active low signal." range="16" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG14_ST_EN" width="1" begin="14" end="14" resetval="0x1" description="Receiver Schmitt Trigger enable" range="14" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG14_DEBOUNCE_SEL" width="3" begin="13" end="11" resetval="0x0" description="Selects the debouce period for the pad." range="13 - 11" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG14_MUXMODE" width="4" begin="3" end="0" resetval="0x7" description="Pad functional signal mux selection" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_PADCONFIG15" acronym="CFG0_PADCONFIG15" offset="0x403C" width="32" description="">
		<bitfield id="PADCONFIG15_LOCK" width="1" begin="31" end="31" resetval="0x0" description="Lock" range="31" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG15_TX_DIS" width="1" begin="21" end="21" resetval="0x1" description="Driver Disable" range="21" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG15_DRV_STR" width="2" begin="20" end="19" resetval="0x0" description="Drive Strength Control .  Selects the drive strength value for LVCMOS pins.  (Does not apply to other pin types)" range="20 - 19" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG15_RXACTIVE" width="1" begin="18" end="18" resetval="0x0" description="Input enable for the Pad" range="18" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG15_PULLTYPESEL" width="1" begin="17" end="17" resetval="0x0" description="Pad Pullup / Pulldown type selection" range="17" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG15_PULLUDEN" width="1" begin="16" end="16" resetval="0x1" description="Pad Pullup / Pulldown enable. This is an active low signal." range="16" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG15_ST_EN" width="1" begin="14" end="14" resetval="0x1" description="Receiver Schmitt Trigger enable" range="14" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG15_DEBOUNCE_SEL" width="3" begin="13" end="11" resetval="0x0" description="Selects the debouce period for the pad." range="13 - 11" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG15_MUXMODE" width="4" begin="3" end="0" resetval="0x7" description="Pad functional signal mux selection" range="3 - 0" rwaccess="R/W"/>
	</register>
