IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/MCU_PADCFG_CTRL0_CFG0.xml
	<register id="CFG0_PADCONFIG22" acronym="CFG0_PADCONFIG22" offset="0x4058" width="32" description="">
		<bitfield id="PADCONFIG22_LOCK" width="1" begin="31" end="31" resetval="0x0" description="Lock" range="31" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG22_TX_DIS" width="1" begin="21" end="21" resetval="0x1" description="Driver Disable" range="21" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG22_DRV_STR" width="2" begin="20" end="19" resetval="0x0" description="Drive Strength Control .  Selects the drive strength value for LVCMOS pins.  (Does not apply to other pin types)" range="20 - 19" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG22_RXACTIVE" width="1" begin="18" end="18" resetval="0x1" description="Input enable for the Pad" range="18" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG22_PULLTYPESEL" width="1" begin="17" end="17" resetval="0x1" description="Pad Pullup / Pulldown type selection" range="17" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG22_PULLUDEN" width="1" begin="16" end="16" resetval="0x0" description="Pad Pullup / Pulldown enable. This is an active low signal." range="16" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG22_ST_EN" width="1" begin="14" end="14" resetval="0x1" description="Receiver Schmitt Trigger enable" range="14" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG22_DEBOUNCE_SEL" width="3" begin="13" end="11" resetval="0x0" description="Selects the debouce period for the pad." range="13 - 11" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG22_MUXMODE" width="4" begin="3" end="0" resetval="0x0" description="Pad functional signal mux selection" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_PADCONFIG23" acronym="CFG0_PADCONFIG23" offset="0x405C" width="32" description="">
		<bitfield id="PADCONFIG23_LOCK" width="1" begin="31" end="31" resetval="0x0" description="Lock" range="31" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG23_TX_DIS" width="1" begin="21" end="21" resetval="0x0" description="Driver Disable" range="21" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG23_DRV_STR" width="2" begin="20" end="19" resetval="0x0" description="Drive Strength Control .  Selects the drive strength value for LVCMOS pins.  (Does not apply to other pin types)" range="20 - 19" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG23_RXACTIVE" width="1" begin="18" end="18" resetval="0x0" description="Input enable for the Pad" range="18" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG23_PULLTYPESEL" width="1" begin="17" end="17" resetval="0x0" description="Pad Pullup / Pulldown type selection" range="17" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG23_PULLUDEN" width="1" begin="16" end="16" resetval="0x1" description="Pad Pullup / Pulldown enable. This is an active low signal." range="16" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG23_ST_EN" width="1" begin="14" end="14" resetval="0x1" description="Receiver Schmitt Trigger enable" range="14" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG23_DEBOUNCE_SEL" width="3" begin="13" end="11" resetval="0x0" description="Selects the debouce period for the pad." range="13 - 11" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG23_MUXMODE" width="4" begin="3" end="0" resetval="0x0" description="Pad functional signal mux selection" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_PADCONFIG24" acronym="CFG0_PADCONFIG24" offset="0x4060" width="32" description="">
		<bitfield id="PADCONFIG24_LOCK" width="1" begin="31" end="31" resetval="0x0" description="Lock" range="31" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG24_TX_DIS" width="1" begin="21" end="21" resetval="0x0" description="Driver Disable" range="21" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG24_DRV_STR" width="2" begin="20" end="19" resetval="0x0" description="Drive Strength Control .  Selects the drive strength value for LVCMOS pins.  (Does not apply to other pin types)" range="20 - 19" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG24_RXACTIVE" width="1" begin="18" end="18" resetval="0x0" description="Input enable for the Pad" range="18" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG24_PULLTYPESEL" width="1" begin="17" end="17" resetval="0x0" description="Pad Pullup / Pulldown type selection" range="17" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG24_PULLUDEN" width="1" begin="16" end="16" resetval="0x1" description="Pad Pullup / Pulldown enable. This is an active low signal." range="16" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG24_ST_EN" width="1" begin="14" end="14" resetval="0x1" description="Receiver Schmitt Trigger enable" range="14" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG24_DEBOUNCE_SEL" width="3" begin="13" end="11" resetval="0x0" description="Selects the debouce period for the pad." range="13 - 11" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG24_MUXMODE" width="4" begin="3" end="0" resetval="0x0" description="Pad functional signal mux selection" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_PADCONFIG25" acronym="CFG0_PADCONFIG25" offset="0x4064" width="32" description="">
		<bitfield id="PADCONFIG25_LOCK" width="1" begin="31" end="31" resetval="0x0" description="Lock" range="31" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG25_TX_DIS" width="1" begin="21" end="21" resetval="0x0" description="Driver Disable" range="21" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG25_DRV_STR" width="2" begin="20" end="19" resetval="0x0" description="Drive Strength Control .  Selects the drive strength value for LVCMOS pins.  (Does not apply to other pin types)" range="20 - 19" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG25_RXACTIVE" width="1" begin="18" end="18" resetval="0x1" description="Input enable for the Pad" range="18" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG25_PULLTYPESEL" width="1" begin="17" end="17" resetval="0x0" description="Pad Pullup / Pulldown type selection" range="17" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG25_PULLUDEN" width="1" begin="16" end="16" resetval="0x0" description="Pad Pullup / Pulldown enable. This is an active low signal." range="16" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG25_ST_EN" width="1" begin="14" end="14" resetval="0x1" description="Receiver Schmitt Trigger enable" range="14" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG25_DEBOUNCE_SEL" width="3" begin="13" end="11" resetval="0x0" description="Selects the debouce period for the pad." range="13 - 11" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG25_MUXMODE" width="4" begin="3" end="0" resetval="0x0" description="Pad functional signal mux selection" range="3 - 0" rwaccess="R/W"/>
	</register>
