IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/MCU_PADCFG_CTRL0_CFG0.xml
	<register id="CFG0_PADCONFIG11_PROXY" acronym="CFG0_PADCONFIG11_PROXY" offset="0x602C" width="32" description="">
		<bitfield id="PADCONFIG11_LOCK_PROXY" width="1" begin="31" end="31" resetval="0x0" description="Lock" range="31" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG11_TX_DIS_PROXY" width="1" begin="21" end="21" resetval="0x1" description="Driver Disable" range="21" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG11_DRV_STR_PROXY" width="2" begin="20" end="19" resetval="0x0" description="Drive Strength Control .  Selects the drive strength value for LVCMOS pins.  (Does not apply to other pin types)" range="20 - 19" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG11_RXACTIVE_PROXY" width="1" begin="18" end="18" resetval="0x0" description="Input enable for the Pad" range="18" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG11_PULLTYPESEL_PROXY" width="1" begin="17" end="17" resetval="0x0" description="Pad Pullup / Pulldown type selection" range="17" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG11_PULLUDEN_PROXY" width="1" begin="16" end="16" resetval="0x1" description="Pad Pullup / Pulldown enable. This is an active low signal." range="16" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG11_ST_EN_PROXY" width="1" begin="14" end="14" resetval="0x1" description="Receiver Schmitt Trigger enable" range="14" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG11_DEBOUNCE_SEL_PROXY" width="3" begin="13" end="11" resetval="0x0" description="Selects the debouce period for the pad." range="13 - 11" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG11_MUXMODE_PROXY" width="4" begin="3" end="0" resetval="0x7" description="Pad functional signal mux selection" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_PADCONFIG12_PROXY" acronym="CFG0_PADCONFIG12_PROXY" offset="0x6030" width="32" description="">
		<bitfield id="PADCONFIG12_LOCK_PROXY" width="1" begin="31" end="31" resetval="0x0" description="Lock" range="31" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG12_TX_DIS_PROXY" width="1" begin="21" end="21" resetval="0x1" description="Driver Disable" range="21" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG12_DRV_STR_PROXY" width="2" begin="20" end="19" resetval="0x0" description="Drive Strength Control .  Selects the drive strength value for LVCMOS pins.  (Does not apply to other pin types)" range="20 - 19" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG12_RXACTIVE_PROXY" width="1" begin="18" end="18" resetval="0x0" description="Input enable for the Pad" range="18" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG12_PULLTYPESEL_PROXY" width="1" begin="17" end="17" resetval="0x0" description="Pad Pullup / Pulldown type selection" range="17" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG12_PULLUDEN_PROXY" width="1" begin="16" end="16" resetval="0x1" description="Pad Pullup / Pulldown enable. This is an active low signal." range="16" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG12_ST_EN_PROXY" width="1" begin="14" end="14" resetval="0x1" description="Receiver Schmitt Trigger enable" range="14" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG12_DEBOUNCE_SEL_PROXY" width="3" begin="13" end="11" resetval="0x0" description="Selects the debouce period for the pad." range="13 - 11" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG12_MUXMODE_PROXY" width="4" begin="3" end="0" resetval="0x7" description="Pad functional signal mux selection" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_PADCONFIG13_PROXY" acronym="CFG0_PADCONFIG13_PROXY" offset="0x6034" width="32" description="">
		<bitfield id="PADCONFIG13_LOCK_PROXY" width="1" begin="31" end="31" resetval="0x0" description="Lock" range="31" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG13_TX_DIS_PROXY" width="1" begin="21" end="21" resetval="0x1" description="Driver Disable" range="21" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG13_DRV_STR_PROXY" width="2" begin="20" end="19" resetval="0x0" description="Drive Strength Control .  Selects the drive strength value for LVCMOS pins.  (Does not apply to other pin types)" range="20 - 19" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG13_RXACTIVE_PROXY" width="1" begin="18" end="18" resetval="0x0" description="Input enable for the Pad" range="18" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG13_PULLTYPESEL_PROXY" width="1" begin="17" end="17" resetval="0x0" description="Pad Pullup / Pulldown type selection" range="17" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG13_PULLUDEN_PROXY" width="1" begin="16" end="16" resetval="0x1" description="Pad Pullup / Pulldown enable. This is an active low signal." range="16" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG13_ST_EN_PROXY" width="1" begin="14" end="14" resetval="0x1" description="Receiver Schmitt Trigger enable" range="14" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG13_DEBOUNCE_SEL_PROXY" width="3" begin="13" end="11" resetval="0x0" description="Selects the debouce period for the pad." range="13 - 11" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG13_MUXMODE_PROXY" width="4" begin="3" end="0" resetval="0x7" description="Pad functional signal mux selection" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_PADCONFIG14_PROXY" acronym="CFG0_PADCONFIG14_PROXY" offset="0x6038" width="32" description="">
		<bitfield id="PADCONFIG14_LOCK_PROXY" width="1" begin="31" end="31" resetval="0x0" description="Lock" range="31" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG14_TX_DIS_PROXY" width="1" begin="21" end="21" resetval="0x1" description="Driver Disable" range="21" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG14_DRV_STR_PROXY" width="2" begin="20" end="19" resetval="0x0" description="Drive Strength Control .  Selects the drive strength value for LVCMOS pins.  (Does not apply to other pin types)" range="20 - 19" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG14_RXACTIVE_PROXY" width="1" begin="18" end="18" resetval="0x0" description="Input enable for the Pad" range="18" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG14_PULLTYPESEL_PROXY" width="1" begin="17" end="17" resetval="0x0" description="Pad Pullup / Pulldown type selection" range="17" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG14_PULLUDEN_PROXY" width="1" begin="16" end="16" resetval="0x1" description="Pad Pullup / Pulldown enable. This is an active low signal." range="16" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG14_ST_EN_PROXY" width="1" begin="14" end="14" resetval="0x1" description="Receiver Schmitt Trigger enable" range="14" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG14_DEBOUNCE_SEL_PROXY" width="3" begin="13" end="11" resetval="0x0" description="Selects the debouce period for the pad." range="13 - 11" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG14_MUXMODE_PROXY" width="4" begin="3" end="0" resetval="0x7" description="Pad functional signal mux selection" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_PADCONFIG15_PROXY" acronym="CFG0_PADCONFIG15_PROXY" offset="0x603C" width="32" description="">
		<bitfield id="PADCONFIG15_LOCK_PROXY" width="1" begin="31" end="31" resetval="0x0" description="Lock" range="31" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG15_TX_DIS_PROXY" width="1" begin="21" end="21" resetval="0x1" description="Driver Disable" range="21" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG15_DRV_STR_PROXY" width="2" begin="20" end="19" resetval="0x0" description="Drive Strength Control .  Selects the drive strength value for LVCMOS pins.  (Does not apply to other pin types)" range="20 - 19" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG15_RXACTIVE_PROXY" width="1" begin="18" end="18" resetval="0x0" description="Input enable for the Pad" range="18" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG15_PULLTYPESEL_PROXY" width="1" begin="17" end="17" resetval="0x0" description="Pad Pullup / Pulldown type selection" range="17" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG15_PULLUDEN_PROXY" width="1" begin="16" end="16" resetval="0x1" description="Pad Pullup / Pulldown enable. This is an active low signal." range="16" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG15_ST_EN_PROXY" width="1" begin="14" end="14" resetval="0x1" description="Receiver Schmitt Trigger enable" range="14" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG15_DEBOUNCE_SEL_PROXY" width="3" begin="13" end="11" resetval="0x0" description="Selects the debouce period for the pad." range="13 - 11" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG15_MUXMODE_PROXY" width="4" begin="3" end="0" resetval="0x7" description="Pad functional signal mux selection" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_PADCONFIG16_PROXY" acronym="CFG0_PADCONFIG16_PROXY" offset="0x6040" width="32" description="">
		<bitfield id="PADCONFIG16_LOCK_PROXY" width="1" begin="31" end="31" resetval="0x0" description="Lock" range="31" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG16_TX_DIS_PROXY" width="1" begin="21" end="21" resetval="0x1" description="Driver Disable" range="21" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG16_DRV_STR_PROXY" width="2" begin="20" end="19" resetval="0x0" description="Drive Strength Control .  Selects the drive strength value for LVCMOS pins.  (Does not apply to other pin types)" range="20 - 19" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG16_RXACTIVE_PROXY" width="1" begin="18" end="18" resetval="0x0" description="Input enable for the Pad" range="18" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG16_PULLTYPESEL_PROXY" width="1" begin="17" end="17" resetval="0x0" description="Pad Pullup / Pulldown type selection" range="17" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG16_PULLUDEN_PROXY" width="1" begin="16" end="16" resetval="0x1" description="Pad Pullup / Pulldown enable. This is an active low signal." range="16" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG16_ST_EN_PROXY" width="1" begin="14" end="14" resetval="0x1" description="Receiver Schmitt Trigger enable" range="14" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG16_DEBOUNCE_SEL_PROXY" width="3" begin="13" end="11" resetval="0x0" description="Selects the debouce period for the pad." range="13 - 11" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG16_MUXMODE_PROXY" width="4" begin="3" end="0" resetval="0x7" description="Pad functional signal mux selection" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_PADCONFIG17_PROXY" acronym="CFG0_PADCONFIG17_PROXY" offset="0x6044" width="32" description="">
		<bitfield id="PADCONFIG17_LOCK_PROXY" width="1" begin="31" end="31" resetval="0x0" description="Lock" range="31" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG17_TX_DIS_PROXY" width="1" begin="21" end="21" resetval="0x1" description="Driver Disable" range="21" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG17_DRV_STR_PROXY" width="2" begin="20" end="19" resetval="0x0" description="Drive Strength Control .  Selects the drive strength value for LVCMOS pins.  (Does not apply to other pin types)" range="20 - 19" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG17_RXACTIVE_PROXY" width="1" begin="18" end="18" resetval="0x0" description="Input enable for the Pad" range="18" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG17_PULLTYPESEL_PROXY" width="1" begin="17" end="17" resetval="0x0" description="Pad Pullup / Pulldown type selection" range="17" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG17_PULLUDEN_PROXY" width="1" begin="16" end="16" resetval="0x1" description="Pad Pullup / Pulldown enable. This is an active low signal." range="16" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG17_ST_EN_PROXY" width="1" begin="14" end="14" resetval="0x1" description="Receiver Schmitt Trigger enable" range="14" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG17_DEBOUNCE_SEL_PROXY" width="3" begin="13" end="11" resetval="0x0" description="Selects the debouce period for the pad." range="13 - 11" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG17_MUXMODE_PROXY" width="4" begin="3" end="0" resetval="0x7" description="Pad functional signal mux selection" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_PADCONFIG18_PROXY" acronym="CFG0_PADCONFIG18_PROXY" offset="0x6048" width="32" description="">
		<bitfield id="PADCONFIG18_LOCK_PROXY" width="1" begin="31" end="31" resetval="0x0" description="Lock" range="31" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG18_TX_DIS_PROXY" width="1" begin="21" end="21" resetval="0x0" description="Driver Disable" range="21" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG18_DRV_STR_PROXY" width="2" begin="20" end="19" resetval="0x0" description="Drive Strength Control .  Selects the drive strength value for LVCMOS pins.  (Does not apply to other pin types)" range="20 - 19" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG18_RXACTIVE_PROXY" width="1" begin="18" end="18" resetval="0x1" description="Input enable for the Pad" range="18" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG18_PULLTYPESEL_PROXY" width="1" begin="17" end="17" resetval="0x0" description="Pad Pullup / Pulldown type selection" range="17" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG18_PULLUDEN_PROXY" width="1" begin="16" end="16" resetval="0x1" description="Pad Pullup / Pulldown enable. This is an active low signal." range="16" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG18_ST_EN_PROXY" width="1" begin="14" end="14" resetval="0x1" description="Receiver Schmitt Trigger enable" range="14" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG18_DEBOUNCE_SEL_PROXY" width="3" begin="13" end="11" resetval="0x0" description="Selects the debouce period for the pad." range="13 - 11" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG18_MUXMODE_PROXY" width="4" begin="3" end="0" resetval="0x7" description="Pad functional signal mux selection" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_PADCONFIG19_PROXY" acronym="CFG0_PADCONFIG19_PROXY" offset="0x604C" width="32" description="">
		<bitfield id="PADCONFIG19_LOCK_PROXY" width="1" begin="31" end="31" resetval="0x0" description="Lock" range="31" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG19_TX_DIS_PROXY" width="1" begin="21" end="21" resetval="0x0" description="Driver Disable" range="21" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG19_DRV_STR_PROXY" width="2" begin="20" end="19" resetval="0x0" description="Drive Strength Control .  Selects the drive strength value for LVCMOS pins.  (Does not apply to other pin types)" range="20 - 19" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG19_RXACTIVE_PROXY" width="1" begin="18" end="18" resetval="0x1" description="Input enable for the Pad" range="18" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG19_PULLTYPESEL_PROXY" width="1" begin="17" end="17" resetval="0x0" description="Pad Pullup / Pulldown type selection" range="17" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG19_PULLUDEN_PROXY" width="1" begin="16" end="16" resetval="0x1" description="Pad Pullup / Pulldown enable. This is an active low signal." range="16" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG19_ST_EN_PROXY" width="1" begin="14" end="14" resetval="0x1" description="Receiver Schmitt Trigger enable" range="14" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG19_DEBOUNCE_SEL_PROXY" width="3" begin="13" end="11" resetval="0x0" description="Selects the debouce period for the pad." range="13 - 11" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG19_MUXMODE_PROXY" width="4" begin="3" end="0" resetval="0x7" description="Pad functional signal mux selection" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_PADCONFIG20_PROXY" acronym="CFG0_PADCONFIG20_PROXY" offset="0x6050" width="32" description="">
		<bitfield id="PADCONFIG20_LOCK_PROXY" width="1" begin="31" end="31" resetval="0x0" description="Lock" range="31" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG20_TX_DIS_PROXY" width="1" begin="21" end="21" resetval="0x1" description="Driver Disable" range="21" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG20_DRV_STR_PROXY" width="2" begin="20" end="19" resetval="0x0" description="Drive Strength Control .  Selects the drive strength value for LVCMOS pins.  (Does not apply to other pin types)" range="20 - 19" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG20_RXACTIVE_PROXY" width="1" begin="18" end="18" resetval="0x0" description="Input enable for the Pad" range="18" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG20_PULLTYPESEL_PROXY" width="1" begin="17" end="17" resetval="0x0" description="Pad Pullup / Pulldown type selection" range="17" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG20_PULLUDEN_PROXY" width="1" begin="16" end="16" resetval="0x1" description="Pad Pullup / Pulldown enable. This is an active low signal." range="16" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG20_ST_EN_PROXY" width="1" begin="14" end="14" resetval="0x1" description="Receiver Schmitt Trigger enable" range="14" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG20_DEBOUNCE_SEL_PROXY" width="3" begin="13" end="11" resetval="0x0" description="Selects the debouce period for the pad." range="13 - 11" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG20_MUXMODE_PROXY" width="4" begin="3" end="0" resetval="0x7" description="Pad functional signal mux selection" range="3 - 0" rwaccess="R/W"/>
	</register>
