IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/MCU_PADCFG_CTRL0_CFG0.xml
	<register id="CFG0_PADCONFIG31_PROXY" acronym="CFG0_PADCONFIG31_PROXY" offset="0x607C" width="32" description="">
		<bitfield id="PADCONFIG31_LOCK_PROXY" width="1" begin="31" end="31" resetval="0x0" description="Lock" range="31" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG31_TX_DIS_PROXY" width="1" begin="21" end="21" resetval="0x1" description="Driver Disable" range="21" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG31_DRV_STR_PROXY" width="2" begin="20" end="19" resetval="0x0" description="Drive Strength Control .  Selects the drive strength value for LVCMOS pins.  (Does not apply to other pin types)" range="20 - 19" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG31_RXACTIVE_PROXY" width="1" begin="18" end="18" resetval="0x1" description="Input enable for the Pad" range="18" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG31_PULLTYPESEL_PROXY" width="1" begin="17" end="17" resetval="0x1" description="Pad Pullup / Pulldown type selection" range="17" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG31_PULLUDEN_PROXY" width="1" begin="16" end="16" resetval="0x0" description="Pad Pullup / Pulldown enable. This is an active low signal." range="16" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG31_ST_EN_PROXY" width="1" begin="14" end="14" resetval="0x1" description="Receiver Schmitt Trigger enable" range="14" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG31_DEBOUNCE_SEL_PROXY" width="3" begin="13" end="11" resetval="0x0" description="Selects the debouce period for the pad." range="13 - 11" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG31_MUXMODE_PROXY" width="4" begin="3" end="0" resetval="0x0" description="Pad functional signal mux selection" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_PADCONFIG32_PROXY" acronym="CFG0_PADCONFIG32_PROXY" offset="0x6080" width="32" description="">
		<bitfield id="PADCONFIG32_LOCK_PROXY" width="1" begin="31" end="31" resetval="0x0" description="Lock" range="31" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG32_TX_DIS_PROXY" width="1" begin="21" end="21" resetval="0x1" description="Driver Disable" range="21" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG32_DRV_STR_PROXY" width="2" begin="20" end="19" resetval="0x0" description="Drive Strength Control .  Selects the drive strength value for LVCMOS pins.  (Does not apply to other pin types)" range="20 - 19" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG32_RXACTIVE_PROXY" width="1" begin="18" end="18" resetval="0x1" description="Input enable for the Pad" range="18" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG32_PULLTYPESEL_PROXY" width="1" begin="17" end="17" resetval="0x1" description="Pad Pullup / Pulldown type selection" range="17" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG32_PULLUDEN_PROXY" width="1" begin="16" end="16" resetval="0x0" description="Pad Pullup / Pulldown enable. This is an active low signal." range="16" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG32_ST_EN_PROXY" width="1" begin="14" end="14" resetval="0x1" description="Receiver Schmitt Trigger enable" range="14" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG32_DEBOUNCE_SEL_PROXY" width="3" begin="13" end="11" resetval="0x0" description="Selects the debouce period for the pad." range="13 - 11" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG32_MUXMODE_PROXY" width="4" begin="3" end="0" resetval="0x0" description="Pad functional signal mux selection" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_LOCK1_KICK0_PROXY" acronym="CFG0_LOCK1_KICK0_PROXY" offset="0x7008" width="32" description="">
		<bitfield id="LOCK1_KICK0_PROXY" width="32" begin="31" end="0" resetval="0x0" description=" - KICK0 component" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_LOCK1_KICK1_PROXY" acronym="CFG0_LOCK1_KICK1_PROXY" offset="0x700C" width="32" description="">
		<bitfield id="LOCK1_KICK1_PROXY" width="32" begin="31" end="0" resetval="0x0" description=" - KICK1 component" range="31 - 0" rwaccess="R/W"/>
	</register>
</module>